/*
    Завдання 3:
    Написати програму обчислення вартості поїздки на автомобілі на дачу (туди і назад).
    Початковими даними є: відстань до дачі (км); кількість палива, яку споживає автомобіль
    на 100 км пробігу; ціна одного літру палива. Програма має вивести загальну вартість поїздки.
*/

#include <iostream>
#include <cmath>
#include "console_utils.h" // Підключаємо наші функції кодування

using namespace std;

// Функція для обчислення вартості поїздки
void processTask3() {

    // кодування до UTF-8
    setUtf8Encoding();

    // Оголошуємо змінні
    double distance, fuel_consumption, fuel_price;

    // Введення відстані до дачі
    cout << "Введіть відстань до дачі (км): ";
    cin >> distance;

    // Введення витрати палива
    cout << "Введіть витрати палива (літрів на 100 км пробігу): ";
    cin >> fuel_consumption;

    // Введення ціни за літр палива
    cout << "Введіть ціну літру палива (грн): ";
    cin >> fuel_price;

    // Розрахунок вартості поїздки туди і назад
    const double total_cost = (2 * distance) * (fuel_consumption / 100) * fuel_price;

    // Виведення загальної вартості поїздки
    cout << "Поїздка на дачу і назад обійдеться в " << round(total_cost) << " грн." << endl;

}

int main() {
    // Викликаємо функцію обробки
    processTask3();

    return 0;
}
