/*
    Завдання 2:
    Вивести на екран в один рядок три будь-яких випадкових числа з двома пробілами між ними.
*/

#include <iostream>
#include <cstdlib> // Для функцій rand() і srand()
#include <ctime>   // Для функції time()

using namespace std;

// Функція для виведення трьох випадкових чисел в один рядок з двома пробілами
void processTask2() {

    // Ініціалізуємо генератор випадкових чисел
    srand(static_cast<unsigned int>(time(0)));

    // Генеруємо три випадкові числа
    int num1 = rand() % 100; // Випадкове число від 0 до 99
    int num2 = rand() % 100;
    int num3 = rand() % 100;

    // Виводимо випадкові числа в один рядок з двома пробілами між ними
    cout << num1 << "  " << num2 << "  " << num3 << endl;

}

//int main() {
//    // Викликаємо функцію обробки
//    processTask2();
//
//    return 0;
//}

