#ifndef MENUS_H
#define MENUS_H

// ===================== ГОЛОВНЕ МЕНЮ =====================
static auto MAIN_MENU = R"(
=== Головне меню ===
1 — Табулювати функцію
2 — Інтеграл (Сімпсон)
3 — Вихід
Ваш вибір: )";

// ===================== МЕНЮ ТАБУЛЯЦІЇ =====================
static auto TABULATION_MENU = R"(
=== Вибір функції для табулювання ===
1 — sin(x)
2 — x^2
3 — e^x
4 — Назад
Ваш вибір: )";

// ===================== МЕНЮ ПОМИЛОК ВВОДУ =====================
static auto INPUT_ERROR_MENU = R"(
1 — повторити введення
2 — повернутись у меню
Ваш вибір: )";

// ===================== МЕНЮ СІМПСОНА =====================
static auto SIMPSON_MENU = R"(
=== Інтеграл методом Сімпсона ===
1 — sin(x)
2 — x^2
3 — e^x
4 — Назад
Ваш вибір: )";

#endif //MENUS_H
