#include <iostream>  // Підключаємо бібліотеку для введення-виведення
#include <windows.h> // Підключаємо бібліотеку для роботи з функціями Windows

/*
   Дозволяє використовувати елементи стандартної бібліотеки C++ (наприклад, cout, cin) без префіксу 'std::'.
   Інакше, довелось би писати 'std::cout' та 'std::cin' у кожному випадку використання.
*/
using namespace std;

int main() {
    // Встановлюємо кодування для введення та виведення в консоль (CP1251 для кирилиці)
    SetConsoleCP(1251); // Встановлює кодування для введення (CP1251 для кирилиці)
    SetConsoleOutputCP(1251); // Встановлює кодування для виведення (CP1251 для кирилиці)

    char name[20]; // Оголошуємо масив символів для збереження імені

    // Виводимо запит та зчитуємо ім'я користувача
    cout << "Як тебе звати?" << endl;
    cin >> name;

    // Виводимо привітання з введеним ім'ям
    cout << "Привіт, " << name << endl;

    /*
       Повертаємо кодування консолі до початкового стану (UTF-8).
       Це потрібно для того, щоб після завершення програми інші команди в консолі
       (наприклад, команди Git) могли вводитися та виконуватися коректно.
    */
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);

    return 0; // Повертаємо 0, що означає успішне завершення програми
}